
[
    {
        "id": "wli-adventure",
        "title": "Wli Waterfalls & Mountain Adventure",
        "duration": "2 Days",
        "price": "$180",
        "priceValue": 180,
        "description": "An exciting two-day trip to the Volta Region to hike to Ghana's highest waterfalls and explore the beautiful mountain scenery.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "waterfall jungle",
        "itinerary": [
            {
                "day": 1,
                "title": "Journey to the Volta & Waterfall Hike",
                "details": "*   Morning pickup from your location in Accra.\n*   Scenic drive to the Volta Region, passing through lush landscapes.\n*   Arrive at Wli and check into your guesthouse.\n*   Afternoon hike to the spectacular Wli Waterfalls, Ghana's highest falls. You can swim in the cool, refreshing pool at the base.\n*   Evening relaxation and dinner.",
                "overnight": "Wli Guesthouse"
            },
            {
                "day": 2,
                "title": "Monkey Sanctuary & Return to Accra",
                "details": "*   Morning visit to the Tafi Atome Monkey Sanctuary to interact with friendly Mona monkeys.\n*   Begin the journey back to Accra.\n*   Stop for a local lunch en route.\n*   Arrive back in Accra in the late afternoon.",
                "overnight": "N/A"
            }
        ]
    },
    {
        "id": "cape-coast-history",
        "title": "Cape Coast & Elmina History Tour",
        "duration": "3 Days",
        "price": "$250",
        "priceValue": 250,
        "description": "A profound journey into Ghana's past. Visit the historic slave castles of Cape Coast and Elmina, and walk the Kakum canopy.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "castle ocean",
        "itinerary": [
            {
                "day": 1,
                "title": "Coastal Drive & Kakum Canopy Walk",
                "details": "*   Depart from Accra and drive along the scenic coast to the Central Region.\n*   Visit Kakum National Park and experience the thrilling canopy walkway, suspended 40 meters above the rainforest floor.\n*   Check into your hotel in Cape Coast/Elmina.",
                "overnight": "Hotel in Cape Coast or Elmina"
            },
            {
                "day": 2,
                "title": "The Slave Castles",
                "details": "*   In the morning, take a guided tour of the historic Cape Coast Castle, a former slave trading post.\n*   In the afternoon, visit Elmina Castle, the oldest European building in sub-Saharan Africa, and learn about its somber history.\n*   Explore the bustling fishing town of Elmina.",
                "overnight": "Hotel in Cape Coast or Elmina"
            },
            {
                "day": 3,
                "title": "Assin Manso & Return Journey",
                "details": "*   Visit Assin Manso, the site of the 'Last Bath' where enslaved Africans were bathed before being sent to the castles.\n*   Participate in a solemn wreath-laying and naming ceremony.\n*   Begin your journey back to Accra, arriving in the evening.",
                "overnight": "N/A"
            }
        ]
    },
    {
        "id": "mole-safari",
        "title": "Mole National Park Safari",
        "duration": "4 Days",
        "price": "$480",
        "priceValue": 480,
        "description": "Experience the thrill of a safari in Ghana's largest wildlife refuge. See elephants, antelopes, and hundreds of bird species.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "elephant safari",
        "itinerary": [
             {
                "day": 1,
                "title": "Fly North & Settle In",
                "details": "*   Morning flight from Accra to Tamale.\n*   Our guide will meet you at the airport and begin the drive to Mole National Park.\n*   Check into your hotel (Mole Motel or Zaina Lodge).\n*   Afternoon jeep safari to get your first glimpse of the park's wildlife.",
                "overnight": "Mole National Park"
            },
            {
                "day": 2,
                "title": "Full Day Safari Experience",
                "details": "*   Early morning walking safari with an armed ranger to track elephants on foot.\n*   Return to the hotel for breakfast and relaxation by the pool, which overlooks a watering hole.\n*   Late afternoon jeep safari to explore a different area of the park and see more animals as they come out to graze.",
                "overnight": "Mole National Park"
            },
            {
                "day": 3,
                "title": "Local Culture & Return to Tamale",
                "details": "*   Optional final morning safari.\n*   Visit the nearby Larabanga Mosque, the oldest mosque in Ghana, and the mystical stone.\n*   Drive back to Tamale and check into your hotel.\n*   Explore the Tamale Central Market.",
                "overnight": "Hotel in Tamale"
            },
            {
                "day": 4,
                "title": "Departure",
                "details": "*   Enjoy a final northern breakfast.\n*   Transfer to Tamale Airport for your flight back to Accra.",
                "overnight": "N/A"
            }
        ]
    },
    {
        "id": "accra-city-tour",
        "title": "Accra City Vibe Tour",
        "duration": "1 Day",
        "price": "$95",
        "priceValue": 95,
        "description": "Discover the vibrant heart of Ghana's capital. Explore bustling markets, historical landmarks, and the trendy arts scene of Accra.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "city market",
        "itinerary": [
            {
                "day": 1,
                "title": "A Day in Accra",
                "details": "*   **Morning:** Visit the Kwame Nkrumah Memorial Park & Mausoleum and Independence Square, the heart of Ghana's history.\n*   **Mid-day:** Explore the bustling Makola Market to experience the city's vibrant trade. Then head to Jamestown to see the lighthouse and the local fishing community.\n*   **Afternoon:** Visit the W.E.B. Du Bois Centre for Pan-African Culture. End the day with some souvenir shopping at the Arts Centre.\n*   Drop off at your hotel or preferred location.",
                "overnight": "N/A"
            }
        ]
    },
    {
        "id": "coastal-heritage-7-day",
        "title": "Coastal Heritage & Culture",
        "duration": "7 Days",
        "price": "$1,800",
        "priceValue": 1800,
        "description": "A week-long immersive journey into Ghana's coastal history and vibrant culture, from Accra to the poignant slave castles.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "beach village",
        "itinerary": [
            { "day": 1, "title": "Arrival in Accra", "details": "*   Airport pickup and transfer to your hotel.\n*   Welcome drink and briefing on the upcoming tour.\n*   Depending on arrival time, a short orientation of the neighborhood.", "overnight": "Accra Hotel" },
            { "day": 2, "title": "Accra City Tour", "details": "*   Explore historic Accra, visiting Independence Square, Kwame Nkrumah Memorial Park, and the W.E.B. Du Bois Centre for Pan-African Culture.\n*   Experience the vibrant energy of Jamestown and its iconic lighthouse.", "overnight": "Accra Hotel" },
            { "day": 3, "title": "Journey to Cape Coast & Kakum", "details": "*   Drive from Accra to the Central Region.\n*   Visit Kakum National Park for an exhilarating walk on the canopy walkway high above the rainforest.", "overnight": "Cape Coast/Elmina Hotel" },
            { "day": 4, "title": "The Slave Castles", "details": "*   A sobering and educational day visiting both Cape Coast Castle and Elmina Castle.\n*   Learn about the history of the transatlantic slave trade from knowledgeable local guides.", "overnight": "Cape Coast/Elmina Hotel" },
            { "day": 5, "title": "Assin Manso & Reflection", "details": "*   Journey to Assin Manso, the site of the 'Last Bath' where enslaved Africans were prepared for their journey.\n*   A day for reflection and understanding the historical significance of the region.", "overnight": "Cape Coast/Elmina Hotel" },
            { "day": 6, "title": "Beach Leisure Day", "details": "*   Relax and rejuvenate on the beautiful beaches of the Central Region.\n*   Enjoy the sea breeze, swim, or simply relax at a beachfront restaurant.", "overnight": "Cape Coast/Elmina Hotel" },
            { "day": 7, "title": "Return to Accra & Departure", "details": "*   Enjoy a final coastal breakfast before driving back to Accra.\n*   Last-minute souvenir shopping at the Arts Centre.\n*   Transfer to the airport for your departure.", "overnight": "N/A" }
        ]
    },
    {
        "id": "ultimate-ghana-10-day",
        "title": "Ultimate Ghana Experience",
        "duration": "10 Days",
        "price": "$1,800",
        "priceValue": 1800,
        "description": "The complete package. A comprehensive tour covering Ghana's diverse landscapes, from northern safaris to the cultural heartlands and coastal castles.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "ghana map",
        "itinerary": [
            { "day": 1, "title": "Arrival & Welcome", "details": "Arrive at Kotoka Airport, Accra. Transfer to your hotel for a welcome briefing and dinner.", "overnight": "Accra" },
            { "day": 2, "title": "Fly to Tamale & Mole Safari", "details": "Take a domestic flight to Tamale. Drive to Mole National Park and enjoy an afternoon jeep safari.", "overnight": "Mole Park" },
            { "day": 3, "title": "Journey to Ashanti Kingdom", "details": "Morning safari at Mole. Depart for Kumasi, stopping at the beautiful Kintampo Waterfalls en route.", "overnight": "Kumasi" },
            { "day": 4, "title": "Ashanti Craft Villages", "details": "Explore the rich culture of the Ashanti people by visiting the Kente weaving village of Adanwomase and the Adinkra stamping village of Ntonso.", "overnight": "Kumasi" },
            { "day": 5, "title": "Kumasi City Tour", "details": "Visit the Manhyia Palace Museum (former home of the Ashanti King), the Okomfo Anokye Sword site, and the bustling Kejetia Market.", "overnight": "Kumasi" },
            { "day": 6, "title": "Drive to the Coast", "details": "A scenic drive from Kumasi to Cape Coast. Check into your hotel and relax by the ocean.", "overnight": "Cape Coast" },
            { "day": 7, "title": "Kakum & Cape Coast Castle", "details": "Experience the Kakum National Park canopy walk in the morning. In the afternoon, take a powerful tour of the Cape Coast Castle.", "overnight": "Cape Coast" },
            { "day": 8, "title": "Elmina Castle & Return to Accra", "details": "Visit the historic Elmina Castle. Afterward, begin the drive back to Accra.", "overnight": "Accra" },
            { "day": 9, "title": "Accra Leisure & Arts", "details": "A relaxed day in Accra. Visit the Arts Centre for souvenir shopping or explore the trendy neighborhood of Osu.", "overnight": "Accra" },
            { "day": 10, "title": "Departure", "details": "Enjoy a final Ghanaian breakfast before being transferred to the airport for your flight home.", "overnight": "N/A" }
        ]
    },
    {
        "id": "grand-festivals-12-day",
        "title": "Grand Festivals of Ghana",
        "duration": "12 Days",
        "price": "$2,300",
        "priceValue": 2300,
        "description": "An incredible cultural immersion timed with Ghana's most vibrant festivals. Experience the art of Chale Wote and the royal traditions of Akwasidae.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "festival dancers",
        "itinerary": [
            { "day": 1, "title": "Arrival in Accra", "details": "Welcome to Ghana! Settle into your hotel and prepare for an amazing cultural journey.", "overnight": "Accra" },
            { "day": 2, "title": "Accra City Exploration", "details": "Tour of Accra's key historical sites, including Jamestown and the Du Bois Centre, to set the cultural context.", "overnight": "Accra" },
            { "day": 3, "title": "Chale Wote Street Art Festival", "details": "Spend the day immersed in the vibrant Chale Wote festival in Jamestown. Experience street art, music, dance, and fashion.", "overnight": "Accra" },
            { "day": 4, "title": "Journey to Kumasi", "details": "Travel to Kumasi, the heart of the Ashanti Kingdom. Check into your hotel and relax.", "overnight": "Kumasi" },
            { "day": 5, "title": "Akwasidae Festival", "details": "Witness the splendor of the Akwasidae festival at Manhyia Palace, where the Ashanti King sits in state and receives homage from his sub-chiefs.", "overnight": "Kumasi" },
            { "day": 6, "title": "Ashanti Craft Villages", "details": "Explore the craft villages of Adanwomase (Kente) and Ntonso (Adinkra), learning the traditional crafts firsthand.", "overnight": "Kumasi" },
            { "day": 7, "title": "Drive to Cape Coast", "details": "Travel from the Ashanti heartland to the historic coast. Settle into your hotel with views of the Atlantic.", "overnight": "Cape Coast" },
            { "day": 8, "title": "Cape Coast Castle", "details": "Take a deeply moving tour of the Cape Coast Castle to understand its pivotal role in the history of the region.", "overnight": "Cape Coast" },
            { "day": 9, "title": "Kakum National Park", "details": "Walk among the treetops on the Kakum National Park canopy walk, a nature-filled adventure.", "overnight": "Cape Coast" },
            { "day": 10, "title": "Return to Accra", "details": "Leisurely drive back to Accra. Enjoy a farewell dinner at a restaurant with live Ghanaian music.", "overnight": "Accra" },
            { "day": 11, "title": "Art & Shopping", "details": "Visit a local art gallery and spend time at the Arts Centre for last-minute souvenir shopping.", "overnight": "Accra" },
            { "day": 12, "title": "Departure", "details": "Enjoy a final breakfast and transfer to the airport for your departure.", "overnight": "N/A" }
        ]
    },
    {
        "id": "december-in-ghana",
        "title": "December in Ghana: The Ultimate Experience",
        "duration": "10 Days",
        "price": "$1,800",
        "priceValue": 1800,
        "description": "Experience the legendary 'Detty December' in Ghana. This tour is the perfect blend of parties, culture, history, and beach relaxation.",
        "bookingUrl": "https://wa.me/233200635250",
        "data-ai-hint": "ghana party nightlife",
        "itinerary": [
            { "day": 1, "title": "Arrival & Accra Nightlife Intro", "details": "Arrive at Kotoka Airport, Accra. Transfer to your hotel. In the evening, ease into the vibe with dinner and cocktails in the trendy Osu neighborhood.", "overnight": "Accra" },
            { "day": 2, "title": "History & Culture Grounding", "details": "Morning tour of Accra's historical sites: Jamestown, Nkrumah Memorial Park. Afternoon visit to the Arts Centre for souvenir shopping.", "overnight": "Accra" },
            { "day": 3, "title": "Afrofuture/Afrochella Experience", "details": "Full day dedicated to one of December's flagship music and culture festivals. Enjoy the music, art installations, and fashion.", "overnight": "Accra" },
            { "day": 4, "title": "Cape Coast Day Trip", "details": "A sobering and essential trip to Cape Coast Castle to connect with Ghana's history. Return to Accra in the evening.", "overnight": "Accra" },
            { "day": 5, "title": "Beach Relaxation & Party", "details": "Relax at Labadi Beach. Enjoy horseback riding, local food, and music. As evening approaches, the beach comes alive with parties and bonfires.", "overnight": "Accra" },
            { "day": 6, "title": "Fashion & Food Tour", "details": "Explore local fashion houses and designer stores. In the evening, embark on a food tour to taste Ghana's diverse culinary delights, from street food to upscale dining.", "overnight": "Accra" },
            { "day": 7, "title": "Aburi Mountains Escape", "details": "A day trip to the cooler Aburi Botanical Gardens for a relaxing break from the city buzz. Enjoy the serene environment and beautiful landscapes.", "overnight": "Accra" },
            { "day": 8, "title": "Concert or Live Music Night", "details": "Attend a major concert or a live music session at a venue like +233 Grill & Bar. We will check the event calendar and secure tickets for the best show in town.", "overnight": "Accra" },
            { "day": 9, "title": "New Year's Eve Celebrations", "details": "Day of leisure to prepare for the night. We'll arrange entry to one of Accra's top New Year's Eve parties or a fireworks display event at the beach.", "overnight": "Accra" },
            { "day": 10, "title": "Relaxed Departure", "details": "Enjoy a late brunch. Depending on your flight time, one last stroll before we transfer you to the airport for your departure.", "overnight": "N/A" }
        ]
    }
]
